In [4]:
import pandas as pd
oil = pd.read_csv('oil.csv')
oil

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [3]:
oil.shape

(1218, 2)

In [4]:
oil.index

RangeIndex(start=0, stop=1218, step=1)

In [5]:
oil.columns

Index(['date', 'dcoilwtico'], dtype='object')

In [7]:
oil.columns = ['price_date', 'oil_price']
oil.columns

Index(['price_date', 'oil_price'], dtype='object')

In [8]:
oil.axes

[RangeIndex(start=0, stop=1218, step=1),
 Index(['price_date', 'oil_price'], dtype='object')]

In [9]:
oil.dtypes

price_date     object
oil_price     float64
dtype: object

In [10]:
oil.head()

   price_date  oil_price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20

In [11]:
oil.tail()

      price_date  oil_price
1213  2017-08-25      47.65
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1217  2017-08-31      47.26

In [12]:
oil.sample()

     price_date  oil_price
485  2014-11-11      77.85

In [13]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price_date  1218 non-null   object
 1   oil_price   1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [ ]:
oil.describe()

        price_date    oil_price
count         1218  1175.000000
unique        1218          NaN
top     2017-07-14          NaN
freq             1          NaN
mean           NaN    67.714366
std            NaN    25.630476
min            NaN    26.190000
25%            NaN    46.405000
50%            NaN    53.190000
75%            NaN    95.660000
max            NaN   110.620000

In [ ]:
oil.describe(include="all")

        price_date    oil_price
count         1218  1175.000000
unique        1218          NaN
top     2017-07-14          NaN
freq             1          NaN
mean           NaN    67.714366
std            NaN    25.630476
min            NaN    26.190000
25%            NaN    46.405000
50%            NaN    53.190000
75%            NaN    95.660000
max            NaN   110.620000

In [20]:
oil.sample()

    price_date  oil_price
96  2013-05-15      93.95

for below - brackets around the column names returns a series, brackets returns a dataframe

In [29]:
oil[['price_date','oil_price']]

      price_date  oil_price
0     2013-01-01        NaN
1     2013-01-02      93.14
2     2013-01-03      92.97
3     2013-01-04      93.12
4     2013-01-07      93.20
...          ...        ...
1213  2017-08-25      47.65
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1217  2017-08-31      47.26

[1218 rows x 2 columns]

In [34]:
oil.iloc[20:,0:1]

      price_date
20    2013-01-29
21    2013-01-30
22    2013-01-31
23    2013-02-01
24    2013-02-04
...          ...
1213  2017-08-25
1214  2017-08-28
1215  2017-08-29
1216  2017-08-30
1217  2017-08-31

[1198 rows x 1 columns]

In [37]:
oil.iloc[20,:]  # all columns

price_date    2013-01-29
oil_price          97.62
Name: 20, dtype: object

In [36]:
oil.loc[20:,'price_date']

20      2013-01-29
21      2013-01-30
22      2013-01-31
23      2013-02-01
24      2013-02-04
           ...
1213    2017-08-25
1214    2017-08-28
1215    2017-08-29
1216    2017-08-30
1217    2017-08-31
Name: price_date, Length: 1198, dtype: object

In [8]:
oil.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [10]:
mask = (oil.dcoilwtico > 100) & (oil.date.str[:4] == '2013')
oil.loc[mask]

           date  dcoilwtico
131  2013-07-03      101.92
133  2013-07-05      103.09
134  2013-07-08      103.03
135  2013-07-09      103.46
136  2013-07-10      106.41
..          ...         ...
204  2013-10-14      102.46
205  2013-10-15      101.15
206  2013-10-16      102.34
207  2013-10-17      100.72
208  2013-10-18      100.87

[76 rows x 2 columns]

In [11]:
oil.query("dcoilwtico > 100")

           date  dcoilwtico
131  2013-07-03      101.92
133  2013-07-05      103.09
134  2013-07-08      103.03
135  2013-07-09      103.46
136  2013-07-10      106.41
..          ...         ...
407  2014-07-24      102.76
408  2014-07-25      105.23
409  2014-07-28      105.68
410  2014-07-29      104.91
411  2014-07-30      104.29

[182 rows x 2 columns]

In [12]:
oil.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [ ]:
oil.sort_index(ascending=False)

In [ ]:
oil.sort_values("date")

In [19]:
oil["month"] = oil.date.astype("Datetime64").dt.month
oil.tail()

            date  dcoilwtico  month
1213  2017-08-25       47.65      8
1214  2017-08-28       46.40      8
1215  2017-08-29       46.46      8
1216  2017-08-30       45.96      8
1217  2017-08-31       47.26      8

In [20]:
oil.head()

         date  dcoilwtico  month
0  2013-01-01         NaN      1
1  2013-01-02       93.14      1
2  2013-01-03       92.97      1
3  2013-01-04       93.12      1
4  2013-01-07       93.20      1

In [22]:
oil['tendiscount'] = oil['dcoilwtico'] * 0.9
oil.head()

         date  dcoilwtico  month  tendiscount
0  2013-01-01         NaN      1          NaN
1  2013-01-02       93.14      1       83.826
2  2013-01-03       92.97      1       83.673
3  2013-01-04       93.12      1       83.808
4  2013-01-07       93.20      1       83.880

In [27]:
oil.columns = ['date','price','month','tendiscount']

In [28]:
oil.head()

         date  price  month  tendiscount
0  2013-01-01    NaN      1          NaN
1  2013-01-02  93.14      1       83.826
2  2013-01-03  92.97      1       83.673
3  2013-01-04  93.12      1       83.808
4  2013-01-07  93.20      1       83.880

In [36]:
import numpy as np

In [42]:
conditions = [
    (oil['price'] > 100),
    (oil['price'] < 100) & (oil['price'] > 50),
    (oil['price'] <= 50)
]
choices = ['Too  high', 'Just right', 'Too low']

oil['Goldilocks'] = np.select(conditions, choices, "Missing")

In [43]:
oil['Goldilocks'].value_counts()

Just right    512
Too low       481
Too  high     182
Missing        43
Name: Goldilocks, dtype: int64